linhlttautomation/AC-Battery-Experiment/_1_PV_DC_AC/source/PV_DevInit_F28377S.c
/*
 * PV_DevInit_F28379D.c
 *
 *  Created on: 15 Feb 2017
 *      Author: dinhngock6
 */
//----------------------------------------------------------------------------------
//
//
//
// DESCRIPTION:	Device initialization for F28377x series
//
//----------------------------------------------------------------------------------
//  Copyright Texas Instruments © 2010
//----------------------------------------------------------------------------------

#include "F2837xD_Cla_defines.h"
#include "F2837xD_Examples.h"
#include "stdint.h"


//#include "F2837xS_GlobalPrototypes.h"
#include "stdio.h"

#include "../include/PV_Shared.h"
#include "PeripheralHeaderIncludes.h"


#pragma diag_suppress 70,770

__interrupt void cla1Isr1();
__interrupt void cla1Isr2();
__interrupt void cla1Isr3();
__interrupt void cla1Isr4();
__interrupt void cla1Isr5();
__interrupt void cla1Isr6();
__interrupt void cla1Isr7();
__interrupt void cla1Isr8();


// Functions that will be run from RAM need to be assigned to
// a different section.  This section will then be mapped to a load and
// run address using the linker cmd file.
#ifdef _FLASH
#pragma CODE_SECTION(InitFlash, "ramfuncs");
#endif


extern DelayUs(unsigned int);
extern DelayMs(unsigned long ms);

extern Uint16 RamfuncsLoadStart;
extern Uint16 RamfuncsLoadEnd;
extern Uint16 RamfuncsLoadSize;
extern Uint16 RamfuncsRunStart;
extern Uint16 RamfuncsRunEnd;
extern Uint16 RamfuncsRunSize;


// used by CLA Initialaization function
//extern Uint16 Cla1funcsLoadStart, Cla1funcsLoadEnd, Cla1funcsRunStart,Cla1Prog_Start;
extern uint32_t Cla1funcsRunStart, Cla1funcsLoadStart, Cla1funcsLoadSize, Cla1Prog_Start;
extern uint32_t Cla1mathTablesRunStart, Cla1mathTablesLoadStart, Cla1mathTablesLoadSize;

void DeviceInit(void);
void PieCntlInit(void);
void PieVectTableInit(void);
void InitPeripheralClocks();
void DisablePeripheralClocks();
void WDogDisable(void);

void InitSysPll(Uint16 clock_source, Uint16 imult, Uint16 fmult, Uint16 divsel);
void InitAuxPll(Uint16 clock_source, Uint16 imult, Uint16 fmult, Uint16 divsel);

void ServiceDog(void);
void DisableDog(void);

void InitFlash(void);
void InitFlash_Bank0(void);
void InitFlash_Bank1(void);

void GPIO_EnableUnbondedIOPullups();

void ISR_ILLEGAL(void);
void CLA_Init(void);

void CLA_configClaMemory(void);
void CLA_initCpu1Cla1(void);


void MemCopy(Uint16 *SourceAddr, Uint16* SourceEndAddr, Uint16* DestAddr);

//--------------------------------------------------------------------
//  Configure Device for target Application Here
//--------------------------------------------------------------------
void DeviceInit(void)
{
    WDogDisable();  // Disable the watchdog initially

#ifdef _FLASH
// Copy time critical code and Flash setup code to RAM
// This includes the following functions:  InitFlash();
// The  RamfuncsLoadStart, RamfuncsLoadSize, and RamfuncsRunStart
// symbols are created by the linker. Refer to the device .cmd file.
    memcpy(&RamfuncsRunStart, &RamfuncsLoadStart, (size_t)&RamfuncsLoadSize);

// Call Flash Initialization to setup flash waitstates
// This function must reside in RAM
    InitFlash();
#endif

    DINT;           // Global Disable all Interrupts
    IER = 0x0000;   // Disable CPU interrupts
    IFR = 0x0000;   // Clear all CPU interrupt flags=
    PieCntlInit();
    PieVectTableInit();


    EALLOW;

    //enable pull-ups on unbonded IOs as soon as possible to reduce power consumption.
    GPIO_EnableUnbondedIOPullups();

    CpuSysRegs.PCLKCR13.bit.ADC_A = 1;
    CpuSysRegs.PCLKCR13.bit.ADC_B = 1;
    CpuSysRegs.PCLKCR13.bit.ADC_C = 1;
    CpuSysRegs.PCLKCR13.bit.ADC_D = 1;

    //check if device is trimmed
    if(*((Uint16 *)0x5D1B6) == 0x0000){
        //device is not trimmed, apply static calibration values
        AnalogSubsysRegs.ANAREFTRIMA.all = 31709;
        AnalogSubsysRegs.ANAREFTRIMB.all = 31709;
        AnalogSubsysRegs.ANAREFTRIMC.all = 31709;
        AnalogSubsysRegs.ANAREFTRIMD.all = 31709;
    }

    CpuSysRegs.PCLKCR13.bit.ADC_A = 0;
    CpuSysRegs.PCLKCR13.bit.ADC_B = 0;
    CpuSysRegs.PCLKCR13.bit.ADC_C = 0;
    CpuSysRegs.PCLKCR13.bit.ADC_D = 0;
    EDIS;

// SYSTEM CLOCK speed based on internal oscillator = 10 MHz

   InitSysPll(XTAL_OSC,IMULT_40,FMULT_1,PLLCLK_BY_2);       //PLLSYSCLK = 10Mhz(OSCCLK) * 40 (IMULT) * 1 (FMULT) /  2 (PLLCLK_BY_2)

   EALLOW; // below registers are "protected", allow access.

// LOW SPEED CLOCKS prescale register settings to SCI,SPI, McBSP
    ClkCfgRegs.LOSPCP.all = 0x0000;      // Sysclk / 1 ( MHz) --> 200MHZ

   /* NOTE: EPWMCLK : default  Sysclk/2. */

   //ClkCfgRegs.PERCLKDIVSEL.bit.EPWMCLKDIV =  0;     /*  x0 = /1 of PLLSYSCLK */
  // ClkCfgRegs.PERCLKDIVSEL.bit.EPWMCLKDIV =  1;     /*  x1 = /2 of PLLSYSCLK (default on reset) */


   EDIS;


// PERIPHERAL CLOCK ENABLES
//---------------------------------------------------
    InitPeripheralClocks();


//--------------------------------------------------------------------------------------
// GPIO (GENERAL PURPOSE I/O) CONFIG
//--------------------------------------------------------------------------------------
//-----------------------
// QUICK NOTES on USAGE:
//-----------------------

//--------------------------------------------------------------------------------------
    EALLOW;

//  GPIO-00 - PIN FUNCTION = PWM1A
    GpioCtrlRegs.GPAGMUX1.bit.GPIO0 = 0;    // if GMUX = 0: 0=GPIO, 1= EPWM1A , 2=Resv , 3=Resv
    GpioCtrlRegs.GPAMUX1.bit.GPIO0 = 1;     // 0=GPIO,  1=EPWM2A,  2=Resv,  3=Resv
    GpioCtrlRegs.GPADIR.bit.GPIO0 = 1;      // 1=OUTput,  0=INput

//  GPIO-01 - PIN FUNCTION = PWM1B
    GpioCtrlRegs.GPAGMUX1.bit.GPIO1 = 0;    // if GMUX = 0: 0=GPIO, 1= EPWM1A , 2=Resv , 3=Resv
    GpioCtrlRegs.GPAMUX1.bit.GPIO1 = 1;     // 0=GPIO,  1=EPWM1B,  2=Resv,  3=Resv
    GpioCtrlRegs.GPADIR.bit.GPIO1 = 1;      // 1=OUTput,  0=INput

//  GPIO-02 - PIN FUNCTION = PWM2A
    GpioCtrlRegs.GPAGMUX1.bit.GPIO2 = 0;    // if GMUX = 0: 0=GPIO, 1= EPWM2A , 2=Resv , 3=Resv
    GpioCtrlRegs.GPAMUX1.bit.GPIO2 = 1;     // 0=GPIO,  1=EPWM2A,  2=Resv,  3=Resv
    GpioCtrlRegs.GPADIR.bit.GPIO2 = 1;      // 1=OUTput,  0=INput
//--------------------------------------------------------------------------------------
//  GPIO-03 - PIN FUNCTION = PWM2B
    GpioCtrlRegs.GPAGMUX1.bit.GPIO3 = 0;
    GpioCtrlRegs.GPAMUX1.bit.GPIO3 = 1;     // 0=GPIO,  1=EPWM2B,  2=SPISOMI-A,  3=COMP2OUT
    GpioCtrlRegs.GPADIR.bit.GPIO3 = 1;      // 1=OUTput,  0=INput

//--------------------------------------------------------------------------------------
//  GPIO-04 - PIN FUNCTION = PWM3A
    GpioCtrlRegs.GPAGMUX1.bit.GPIO4 = 0;
    GpioCtrlRegs.GPAMUX1.bit.GPIO4 = 1;     // 0=GPIO,  1=EPWM3A,  2=Resv,  3=Resv
    GpioCtrlRegs.GPADIR.bit.GPIO4 = 1;      // 1=OUTput,  0=INput

//--------------------------------------------------------------------------------------
//  GPIO-05 - PIN FUNCTION = PWM3B
    GpioCtrlRegs.GPAGMUX1.bit.GPIO5 = 0;
    GpioCtrlRegs.GPAMUX1.bit.GPIO5 = 1;     // 0=GPIO,  1=EPWM3A,  2=Resv,  3=Resv
    GpioCtrlRegs.GPADIR.bit.GPIO5 = 1;      // 1=OUTput,  0=INput

//--------------------------------------------------------------------------------------
//  GPIO-06 - PIN FUNCTION = PWM4A
    GpioCtrlRegs.GPAGMUX1.bit.GPIO6 = 0;   //
    GpioCtrlRegs.GPAMUX1.bit.GPIO6 = 1;    // 2=CANTXB,
    GpioCtrlRegs.GPADIR.bit.GPIO6 = 1;     // 1=OUTput

//--------------------------------------------------------------------------------------
//  GPIO-07 - PIN FUNCTION = PWM4B
    GpioCtrlRegs.GPAGMUX1.bit.GPIO7 = 0;   //
    GpioCtrlRegs.GPAMUX1.bit.GPIO7 = 1;    // 2=CANXB,
    GpioCtrlRegs.GPADIR.bit.GPIO7 = 1;     //  0 = INput, 1 = Output

//--------------------------------------------------------------------------------------
//  GPIO-8 - PIN FUNCTION = PWM 5A
    GpioCtrlRegs.GPAGMUX1.bit.GPIO8 = 0;   //
    GpioCtrlRegs.GPAMUX1.bit.GPIO8 = 1;    // 0=GPIO,
    GpioCtrlRegs.GPADIR.bit.GPIO8 = 1;     // 1=OUTput,  0=INput

//--------------------------------------------------------------------------------------
//  GPIO-9 - PIN FUNCTION = PWM 5B
    GpioCtrlRegs.GPAGMUX1.bit.GPIO9 = 0;   //
    GpioCtrlRegs.GPAMUX1.bit.GPIO9 = 1;    // 0=GPIO,
    GpioCtrlRegs.GPADIR.bit.GPIO9 = 1;     // 1=OUTput,  0=INput
//--------------------------------------------------------------------------------------
//  GPIO-10 - PIN FUNCTION = PWM 6A
    GpioCtrlRegs.GPAPUD.bit.GPIO10 = 0;      //
    GpioCtrlRegs.GPAMUX1.bit.GPIO10 = 1;    //
    GpioCtrlRegs.GPADIR.bit.GPIO10 = 1;     // 1=OUTput,  0=INput
//--------------------------------------------------------------------------------------
//  GPIO-11 - PIN FUNCTION = PWM 6B
    GpioCtrlRegs.GPAPUD.bit.GPIO11 = 0;      //
    GpioCtrlRegs.GPAMUX1.bit.GPIO11 = 1;
    GpioCtrlRegs.GPADIR.bit.GPIO11 = 1;     // 1=OUTput,  0=INput
//--------------------------------------------------------------------------------------
//  GPIO-12 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPAGMUX1.bit.GPIO12 = 0;
    GpioCtrlRegs.GPAMUX1.bit.GPIO12 = 0;    //
    GpioCtrlRegs.GPADIR.bit.GPIO12 = 1;     // 1=OUTput,  0=INput

//--------------------------------------------------------------------------------------
//  GPIO-14 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPAGMUX1.bit.GPIO14 = 0;
    GpioCtrlRegs.GPAMUX1.bit.GPIO14 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPADIR.bit.GPIO14 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-15 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPAGMUX1.bit.GPIO15 = 0;
    GpioCtrlRegs.GPAMUX1.bit.GPIO15 = 0;    // 0=GPIO,  1=TZ1,  2=LINRX-A,  3=SPISTE-B
    GpioCtrlRegs.GPADIR.bit.GPIO15 = 1;     // 1=OUTput,  0=INput

//--------------------------------------------------------------------------------------
//  GPIO-16 - PIN FUNCTION = FAULT
    GpioCtrlRegs.GPAGMUX2.bit.GPIO16 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO16 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPADIR.bit.GPIO16 = 0;

//--------------------------------------------------------------------------------------
//  GPIO-17 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPAGMUX2.bit.GPIO17 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO17 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPADIR.bit.GPIO17 = 1;     // 1=OUTput,  0=INput

//--------------------------------------------------------------------------------------
//  GPIO-18 - PIN FUNCTION = CANA_RX
    GpioCtrlRegs.GPAGMUX2.bit.GPIO18 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO18 = 3;    // 0=GPIO, 3=CANA_RX
    GpioCtrlRegs.GPADIR.bit.GPIO18 = 0;     // 1=OUTput,  0=INput

//--------------------------------------------------------------------------------------
//  GPIO-19 - PIN FUNCTION = CANA_TX
    GpioCtrlRegs.GPAGMUX2.bit.GPIO19 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO19 = 3;    // 0=GPIO,  3=CANA_TX
    GpioCtrlRegs.GPADIR.bit.GPIO19 = 1;     // 1=OUTput,  0=INput

//--------------------------------------------------------------------------------------
//  GPIO-20 - PIN FUNCTION = QEP1A
    GpioCtrlRegs.GPAGMUX2.bit.GPIO20 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO20 = 1;    // 0=GPIO,  1=EQEPA-1,  2=Resv,  3=COMP1OUT
    GpioCtrlRegs.GPADIR.bit.GPIO20 = 0;     // 1=OUTput,  0=INput
    GpioCtrlRegs.GPAQSEL2.bit.GPIO20 = 3;    // Asynch input

//--------------------------------------------------------------------------------------
//  GPIO-21 - PIN FUNCTION = QEP1B
    GpioCtrlRegs.GPAGMUX2.bit.GPIO21 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO21 = 1;    // 0=GPIO,  1=EQEPB-1,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPADIR.bit.GPIO21 = 0;     // 1=OUTput,  0=INput
    GpioCtrlRegs.GPAQSEL2.bit.GPIO21 = 3;    // Asynch input

//--------------------------------------------------------------------------------------

//  GPIO-22 - PIN FUNCTION = RESET_U
    GpioCtrlRegs.GPAGMUX2.bit.GPIO22 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO22 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPADIR.bit.GPIO21 = 1;     // 1=OUTput,  0=INput
    GpioCtrlRegs.GPAQSEL2.bit.GPIO22 = 3;    // Asynch input

//--------------------------------------------------------------------------------------

//  GPIO-23 - PIN FUNCTION = GPIO23
    GpioCtrlRegs.GPAGMUX2.bit.GPIO23 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO23 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPADIR.bit.GPIO21 = 0;     // 1=OUTput,  0=INput
    GpioCtrlRegs.GPAQSEL2.bit.GPIO23 = 3;    // Asynch input

//--------------------------------------------------------------------------------------
//  GPIO-24 - PIN FUNCTION = GPIO24
    GpioCtrlRegs.GPAGMUX2.bit.GPIO24 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO24 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPAQSEL2.bit.GPIO24 = 3;    // Asynch input

//--------------------------------------------------------------------------------------
//  GPIO-25 - PIN FUNCTION = GPIO STOP
    GpioCtrlRegs.GPAGMUX2.bit.GPIO25 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO25 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPADIR.bit.GPIO25 = 0;     // 1=OUTput,  0=INput
    GpioCtrlRegs.GPAPUD.bit.GPIO25 = 1;     // disable pull-up
    GpioDataRegs.GPACLEAR.bit.GPIO25 = 1;   //
//--------------------------------------------------------------------------------------

//  GPIO-26 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPAGMUX2.bit.GPIO26 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO26 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPADIR.bit.GPIO26 = 0;     // 1=OUTput,  0=INput
    GpioCtrlRegs.GPAQSEL2.bit.GPIO26 = 3;    // Asynch input
//--------------------------------------------------------------------------------------

//  GPIO-27 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPAGMUX2.bit.GPIO27 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO27 = 0;    // 0=GPIO,  1=Resv,  2=Resv,  3=COMP1OUT
    GpioCtrlRegs.GPADIR.bit.GPIO27 = 1;     // 1=OUTput,  0=INput
    GpioDataRegs.GPACLEAR.bit.GPIO27 = 1;   //
//--------------------------------------------------------------------------------------

//  GPIO-29 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPAGMUX2.bit.GPIO29 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO29 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPADIR.bit.GPIO29 = 1;     // 1=OUTput,  0=INput
    GpioDataRegs.GPACLEAR.bit.GPIO29 = 1;   //
//--------------------------------------------------------------------------------------

