linhlttautomation/AC-Battery-Experiment/_1_PV_DC_AC/source/PV_DevInit_F28377S.c
//  GPIO-31 - PIN FUNCTION = LED_ BLUE
    GpioCtrlRegs.GPAGMUX2.bit.GPIO31 = 0;
    GpioCtrlRegs.GPAMUX2.bit.GPIO31 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPADIR.bit.GPIO31 = 1;     // 1=OUTput,  0=INput
    GpioDataRegs.GPACLEAR.bit.GPIO31 = 1;   //
//--------------------------------------------------------------------------------------

//  GPIO-32 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPBGMUX1.bit.GPIO32 = 0;
    GpioCtrlRegs.GPBMUX1.bit.GPIO32 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPBDIR.bit.GPIO32 = 0;     // 1=OUTput,  0=INput
    GpioCtrlRegs.GPBPUD.bit.GPIO32 = 1;     // disable pull-up
    GpioCtrlRegs.GPBQSEL1.bit.GPIO32 = 3;

//--------------------------------------------------------------------------------------
//  GPIO-34 - PIN FUNCTION = LED RED
    GpioCtrlRegs.GPBGMUX1.bit.GPIO34 = 0;
    GpioCtrlRegs.GPBMUX1.bit.GPIO34 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPBDIR.bit.GPIO34 = 1;     // 1=OUTput,  0=INput
    GpioDataRegs.GPBCLEAR.bit.GPIO34 = 1;   //

//--------------------------------------------------------------------------------------
 //  GPIO-40 - PIN FUNCTION = GPIO START
    GpioCtrlRegs.GPBGMUX1.bit.GPIO41 = 0;   // 0=GPIO,  1=EPWM7B,  2=Resv,  3=Resv
    GpioCtrlRegs.GPBMUX1.bit.GPIO41 = 0;
    GpioCtrlRegs.GPBDIR.bit.GPIO41 = 0;     /* input by default */
    GpioCtrlRegs.GPBPUD.bit.GPIO41 = 1;     /* pull up disabled - driven by PGA */
    GpioDataRegs.GPBSET.bit.GPIO41 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-41 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPBGMUX1.bit.GPIO41 = 0;   // 0=GPIO,  1=EPWM7B,  2=Resv,  3=Resv
    GpioCtrlRegs.GPBMUX1.bit.GPIO41 = 0;
    GpioCtrlRegs.GPBDIR.bit.GPIO41 = 0;     /* input by default */
    GpioCtrlRegs.GPBPUD.bit.GPIO41 = 1;     /* input by default - output collector */
    GpioDataRegs.GPBSET.bit.GPIO41 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-42 - PIN FUNCTION = SCITX - A
    GpioCtrlRegs.GPBGMUX1.bit.GPIO42 = 3;
    GpioCtrlRegs.GPBMUX1.bit.GPIO42 = 3;    //
    GpioCtrlRegs.GPBDIR.bit.GPIO42 = 1;     // 1=OUTput,  0=INput

//--------------------------------------------------------------------------------------
//  GPIO-43 - PIN FUNCTION = SCIRX _A

    GpioCtrlRegs.GPBGMUX1.bit.GPIO43 = 3;
    GpioCtrlRegs.GPBMUX1.bit.GPIO43 = 3;    //
    GpioCtrlRegs.GPBDIR.bit.GPIO43 = 0;     // 1=OUTput,  0=INput
    GpioCtrlRegs.GPBQSEL1.bit.GPIO43 = 0;   /* no qualification */

//--------------------------------------------------------------------------------------
//  GPIO-52 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPBGMUX2.bit.GPIO52 = 0;
    GpioCtrlRegs.GPBMUX2.bit.GPIO52 = 0;    // 0=GPIO
    GpioCtrlRegs.GPBDIR.bit.GPIO52 = 1;     // 1=OUTput
    GpioDataRegs.GPBCLEAR.bit.GPIO52 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-54 - PIN FUNCTION = QEP2A

    GpioCtrlRegs.GPBGMUX2.bit.GPIO54 = 1;
    GpioCtrlRegs.GPBMUX2.bit.GPIO54 = 1;    //
    GpioCtrlRegs.GPBDIR.bit.GPIO54 = 0;     //
    GpioCtrlRegs.GPBQSEL2.bit.GPIO54 = 0;
//--------------------------------------------------------------------------------------
 //  GPIO-55 - PIN FUNCTION = QEP2B

    GpioCtrlRegs.GPBGMUX2.bit.GPIO55 = 1;
    GpioCtrlRegs.GPBMUX2.bit.GPIO55 = 1;    // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPBDIR.bit.GPIO55 = 0;     //
    GpioCtrlRegs.GPBQSEL2.bit.GPIO55 = 0;

//--------------------------------------------------------------------------------------
//  GPIO-56 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPBGMUX2.bit.GPIO56 = 0;
    GpioCtrlRegs.GPBMUX2.bit.GPIO56 = 0;    // 0=GPIO,
    GpioCtrlRegs.GPBDIR.bit.GPIO56 = 1;     // 1=OUTput

//--------------------------------------------------------------------------------------
//  GPIO-57 - PIN FUNCTION = QEP2I
    GpioCtrlRegs.GPBGMUX2.bit.GPIO55 = 1;
    GpioCtrlRegs.GPBMUX2.bit.GPIO55 = 1;    // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPBQSEL2.bit.GPIO55 = 0;

//--------------------------------------------------------------------------------------
//  GPIO-60 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPBGMUX2.bit.GPIO60 = 3;
    GpioCtrlRegs.GPBMUX2.bit.GPIO60 = 3;    // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPBPUD.bit.GPIO60 = 0;      // Enable pull-up

//--------------------------------------------------------------------------------------
//  GPIO-61 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPBGMUX2.bit.GPIO61 = 0;   // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPBMUX2.bit.GPIO61 = 0;
    GpioCtrlRegs.GPBPUD.bit.GPIO61 = 0;      // Enable pull-up

//--------------------------------------------------------------------------------------
//  GPIO-63 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPBGMUX2.bit.GPIO63 = 0;   //
    GpioCtrlRegs.GPBMUX2.bit.GPIO63 = 0;    // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPBQSEL2.bit.GPIO63 = 0;

//--------------------------------------------------------------------------------------
//  GPIO-64 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPCGMUX1.bit.GPIO64 = 0;   // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPCMUX1.bit.GPIO64 = 0;
    GpioCtrlRegs.GPCQSEL1.bit.GPIO64 = 0;

//--------------------------------------------------------------------------------------
//  GPIO-65 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPCGMUX1.bit.GPIO65 = 0;   //
    GpioCtrlRegs.GPCMUX1.bit.GPIO65 = 0;    // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPCQSEL1.bit.GPIO65 = 0;

//--------------------------------------------------------------------------------------
//  GPIO-67 - PIN FUNCTION = ENABLE_PWM
    GpioCtrlRegs.GPCGMUX1.bit.GPIO67 = 0;   // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPCMUX1.bit.GPIO67 = 0;
    GpioCtrlRegs.GPCDIR.bit.GPIO67 = 1;      /*output  */
    GpioDataRegs.GPCCLEAR.bit.GPIO67 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-94 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPCGMUX2.bit.GPIO94 = 0;   //
    GpioCtrlRegs.GPCMUX2.bit.GPIO94 = 0;    // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPCDIR.bit.GPIO94 = 1;     /* output by default */
    GpioCtrlRegs.GPCPUD.bit.GPIO94 = 1;      /* pull up disabled */
    GpioDataRegs.GPCSET.bit.GPIO94 = 1;     /* default 12b resolution */

//--------------------------------------------------------------------------------------
//  GPIO-95 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPCGMUX2.bit.GPIO95 = 0;   //
    GpioCtrlRegs.GPCMUX2.bit.GPIO95 = 0;    // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPCDIR.bit.GPIO95 = 1;     // 1=OUTput,  0=INput
    GpioDataRegs.GPCSET.bit.GPIO95 = 0;     // Enable pull-up

//--------------------------------------------------------------------------------------
//  GPIO-97 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPDGMUX1.bit.GPIO97 = 0;   //
    GpioCtrlRegs.GPDMUX1.bit.GPIO97 = 0;    // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPDDIR.bit.GPIO97 = 1;     /* output by default */
    GpioCtrlRegs.GPDPUD.bit.GPIO97 = 1;     /* pull up disabled */
    GpioDataRegs.GPDSET.bit.GPIO97 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-99 - PIN FUNCTION = EQEP1I
    GpioCtrlRegs.GPDGMUX1.bit.GPIO99 = 1;   //
    GpioCtrlRegs.GPDMUX1.bit.GPIO99 = 1;    // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPDQSEL1.bit.GPIO99 = 3;

//--------------------------------------------------------------------------------------
//  GPIO-104 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPDGMUX1.bit.GPIO104 = 0;
    GpioCtrlRegs.GPDMUX1.bit.GPIO104 = 0;   // 0=GPIO,  1=Resv,  2=Resv,  3=COMP1OUT
    GpioCtrlRegs.GPDDIR.bit.GPIO104 = 1;    // 1=OUTput,  0=INput
    GpioCtrlRegs.GPDPUD.bit.GPIO104 = 1;    // disable pull-up
    GpioDataRegs.GPDCLEAR.bit.GPIO104 = 1;  //

//--------------------------------------------------------------------------------------
//  GPIO-105 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPDGMUX1.bit.GPIO105 = 0;
    GpioCtrlRegs.GPDMUX1.bit.GPIO105 = 0;   // 0=GPIO,
    GpioCtrlRegs.GPDDIR.bit.GPIO105 = 1;    // 1=OUTput,  0=INput
    GpioCtrlRegs.GPDPUD.bit.GPIO105 = 1;    // disable pull-up
    GpioDataRegs.GPDSET.bit.GPIO105 = 1;    //

//--------------------------------------------------------------------------------------
//  GPIO-111 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPDGMUX1.bit.GPIO111 = 0;   //
    GpioCtrlRegs.GPDMUX1.bit.GPIO111 = 0;   // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPDDIR.bit.GPIO111 = 1;        // 1=OUTput,  0=INput
    GpioCtrlRegs.GPDPUD.bit.GPIO111 = 0;         // Enable pull-up
    GpioDataRegs.GPDSET.bit.GPIO111 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-122 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPDGMUX2.bit.GPIO122 = 0;   //
    GpioCtrlRegs.GPDMUX2.bit.GPIO122 = 0;   // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPDDIR.bit.GPIO122 = 0;        // 1=OUTput,  0=INput
    GpioCtrlRegs.GPDPUD.bit.GPIO122 = 0;         // Enable pull-up
    GpioDataRegs.GPDSET.bit.GPIO122 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-123 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPDGMUX2.bit.GPIO123 = 0;   //
    GpioCtrlRegs.GPDMUX2.bit.GPIO123 = 0;   // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPDDIR.bit.GPIO123 = 0;        // 1=OUTput,  0=INput
    GpioCtrlRegs.GPDPUD.bit.GPIO123 = 0;         // Enable pull-up
    GpioDataRegs.GPDSET.bit.GPIO123 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-124 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPDGMUX2.bit.GPIO124 = 0;   //
    GpioCtrlRegs.GPDMUX2.bit.GPIO124 = 0;   // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPDDIR.bit.GPIO124 = 0;        // 1=OUTput,  0=INput
    GpioCtrlRegs.GPDPUD.bit.GPIO124 = 0;         // Enable pull-up
    GpioDataRegs.GPDSET.bit.GPIO124 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-125 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPDGMUX2.bit.GPIO125 = 0;   //
    GpioCtrlRegs.GPDMUX2.bit.GPIO125 = 0;   // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPDDIR.bit.GPIO125 = 1;        // 1=OUTput,  0=INput
    GpioCtrlRegs.GPDPUD.bit.GPIO125 = 0;         // Enable pull-up
    GpioDataRegs.GPDSET.bit.GPIO125 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-130 - PIN FUNCTION = GPIO

    GpioCtrlRegs.GPEGMUX1.bit.GPIO130 = 0;   //
    GpioCtrlRegs.GPEMUX1.bit.GPIO130 = 0;   // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPEDIR.bit.GPIO130 = 0;        // 1=OUTput,  0=INput
    GpioCtrlRegs.GPEPUD.bit.GPIO130 = 0;         // Enable pull-up
    GpioCtrlRegs.GPEQSEL1.bit.GPIO130 = 3;
//--------------------------------------------------------------------------------------
//  GPIO-131 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPEGMUX1.bit.GPIO131 = 0;   //
    GpioCtrlRegs.GPEMUX1.bit.GPIO131 = 0;   // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPEDIR.bit.GPIO131 = 1;        // 1=OUTput,  0=INput
    GpioCtrlRegs.GPEPUD.bit.GPIO131 = 0;         // Enable pull-up
    GpioDataRegs.GPESET.bit.GPIO131 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-139 - PIN FUNCTION = GPIO
    GpioCtrlRegs.GPEGMUX1.bit.GPIO139 = 0;   //
    GpioCtrlRegs.GPEMUX1.bit.GPIO139 = 0;   // 0=GPIO,  1=Resv,  2=Resv,  3=COMP2OUT
    GpioCtrlRegs.GPEDIR.bit.GPIO139 = 1;        // 1=OUTput,  0=INput
    GpioCtrlRegs.GPEPUD.bit.GPIO139 = 0;         // Enable pull-up
    GpioDataRegs.GPESET.bit.GPIO139 = 1;

//--------------------------------------------------------------------------------------
//  GPIO-157 - PIN FUNCTION = DAC3 - PWM7A
    GpioCtrlRegs.GPEGMUX2.bit.GPIO157 = 0;   //
    GpioCtrlRegs.GPEMUX2.bit.GPIO157 = 1;   // 1=PWM

//--------------------------------------------------------------------------------------
//  GPIO-158 - PIN FUNCTION = DAC4 - PWM7B
    GpioCtrlRegs.GPEGMUX2.bit.GPIO158 = 0;   //
    GpioCtrlRegs.GPEMUX2.bit.GPIO158 = 1;   // 1=PWM

//--------------------------------------------------------------------------------------
//  GPIO-159 - PIN FUNCTION = DAC1 - PWM8A
    GpioCtrlRegs.GPEGMUX2.bit.GPIO159 = 0;   //
    GpioCtrlRegs.GPEMUX2.bit.GPIO159 = 1;   // 1=PWM

//--------------------------------------------------------------------------------------
//  GPIO-160 - PIN FUNCTION = DAC2 - PWM8B
    GpioCtrlRegs.GPFGMUX1.bit.GPIO160 = 0;   //
    GpioCtrlRegs.GPFMUX1.bit.GPIO160 = 1;   // 1 = PWM


